In [12]:
import pandas as pd
df=pd.read_csv("spam.csv",encoding="windows-1252")

In [13]:
df.shape

(5572, 5)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [15]:
df.dtypes

v1            object
v2            object
Unnamed: 2    object
Unnamed: 3    object
Unnamed: 4    object
dtype: object

df.drop(columns=["Unnamed: 2",])

In [16]:
df.drop(columns=["Unnamed: 2","Unnamed: 3","Unnamed: 4"],inplace=True)

In [17]:
df.rename(columns={"v1":"target","v2":"text"},inplace=True)

In [18]:
from sklearn.preprocessing import LabelEncoder

encoder = LabelEncoder()
df["target"] = encoder.fit_transform(df["target"])
df.sample(5)

      target                                               text
4776       0  Sorry completely forgot * will pop em round th...
4901       1  * FREE* POLYPHONIC RINGTONE Text SUPER to 8713...
1809       0              Aight, I'll ask a few of my roommates
499        0                            Dear i have reache room
2461       0                                    Anything lar...

In [19]:
df.duplicated().sum()

403

In [20]:
df.drop_duplicates(keep='first',inplace=True)
df.duplicated().sum()

0

In [21]:
df["num_char"]=df["text"].apply(len)
df.sample(5)

      target                                               text  num_char
340        0                       Ok that's great thanx a lot.        28
341        0  I take it the post has come then! You must hav...       151
383        0          Hey i will be late ah... Meet you at 945+        41
2601       0                                               Okie         4
2572       0  The house is on the water with a dock, a boat ...       116

In [22]:
import nltk
nltk.download('punkt_tab')

[nltk_data] Downloading package punkt_tab to
[nltk_data]     /Users/srishtigupta/nltk_data...
[nltk_data]   Package punkt_tab is already up-to-date!

True

In [23]:
df["num_words"]=df["text"].apply(lambda x: len(nltk.word_tokenize(x)))
df.head(5)

,target,text,num_char,num_words
0,0,"Go until jurong point, crazy.. Available only ...",111,24
1,0,Ok lar... Joking wif u oni...,29,8
2,1,Free entry in 2 a wkly comp to win FA Cup fina...,155,37
3,0,U dun say so early hor... U c already then say...,49,13
4,0,"Nah I don't think he goes to usf, he lives aro...",61,15

In [24]:
df["num_sentence"]=df["text"].apply(lambda x: len(nltk.sent_tokenize(x)))
df.head()

,target,text,num_char,num_words,num_sentence
0,0,"Go until jurong point, crazy.. Available only ...",111,24,2
1,0,Ok lar... Joking wif u oni...,29,8,2
2,1,Free entry in 2 a wkly comp to win FA Cup fina...,155,37,2
3,0,U dun say so early hor... U c already then say...,49,13,1
4,0,"Nah I don't think he goes to usf, he lives aro...",61,15,1

In [25]:
df[df["target"] == 0][["num_char","num_words","num_sentence"]].describe()

          num_char    num_words  num_sentence
count  4516.000000  4516.000000   4516.000000
mean     70.459256    17.123782      1.820195
std      56.358207    13.493970      1.383657
min       2.000000     1.000000      1.000000
25%      34.000000     8.000000      1.000000
50%      52.000000    13.000000      1.000000
75%      90.000000    22.000000      2.000000
max     910.000000   220.000000     38.000000

In [26]:
df[df["target"] == 1][["num_char","num_words","num_sentence"]].describe()

         num_char   num_words  num_sentence
count  653.000000  653.000000    653.000000
mean   137.891271   27.667688      2.970904
std     30.137753    7.008418      1.488425
min     13.000000    2.000000      1.000000
25%    132.000000   25.000000      2.000000
50%    149.000000   29.000000      3.000000
75%    157.000000   32.000000      4.000000
max    224.000000   46.000000      9.000000

In [27]:
def trans_lower(text):
    text=text.lower()
    return text

In [29]:
df.sample(5)

,target,text,num_char,num_words,num_sentence
3561,0,Still chance there. If you search hard you wil...,73,19,2
5258,0,1 in cbe. 2 in chennai.,23,8,2
3319,0,Eh sorry leh... I din c ur msg. Not sad alread...,91,25,5
365,0,Well i know Z will take care of me. So no worr...,50,14,2
5132,0,it's still not working. And this time i also t...,114,30,4

In [32]:
df["text"]=df["text"].apply(lambda x: trans_lower(x))

In [33]:
df.sample(5)

,target,text,num_char,num_words,num_sentence
370,0,hello my boytoy ... geeee i miss you already a...,129,32,3
2351,1,download as many ringtones as u like no restri...,120,27,3
1381,0,we spend our days waiting for the ideal path t...,155,37,2
3629,1,get the official england poly ringtone or colo...,157,30,3
5076,0,"guy, no flash me now. if you go call me, call ...",74,23,4

In [ ]:
def trans_text(text):
    text=nltk.word_tokenize(text)
    y=[]
    for i in text:
         if i.append(i)
    text=y